app/controllers/appointments_controller.rb

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`doctor_id` = 7
SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`patient_id` = 9
---
  def index
    @my_apps = Appointment.where(doctor_id: current_user.id) if current_user.doctor?
    @my_apps = Appointment.where(patient_id: current_user.id) if current_user.patient?

INSERT INTO `appointments` (`status`, `doctor_id`, `date`, `created_at`, `updated_at`) VALUES ('pending', 7, '2004-03-07 16:09:00', '2018-01-15 16:10:34', '2018-01-15 16:10:34')
INSERT INTO `notes` (`user_id`, `description`, `appointment_id`, `created_at`, `updated_at`) VALUES (7, 'abcdsef', 22, '2018-01-16 15:12:24', '2018-01-16 15:12:24')
UPDATE `appointments` SET `patient_id` = 9, `updated_at` = '2018-01-15 16:13:09' WHERE `appointments`.`id` = 22
UPDATE `notes` SET `user_id` = 9, `updated_at` = '2018-01-15 18:30:26' WHERE `notes`.`id` = 8
---
  def create

    @appointment = Appointment.create(appointment_params)
    @note = @appointment.notes.create(notes_params)
    @note.user_id = current_user.id
    if current_user.patient?
      @appointment.patient_id = current_user.id
    else
      @appointment.doctor_id = current_user.id
    end

    if @appointment.save && @note.save

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 22 LIMIT 1
SELECT  `appointments`.* FROM `appointments`  ORDER BY `appointments`.`id` DESC LIMIT 1
SELECT  `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 26  ORDER BY `notes`.`id` DESC LIMIT 1
SELECT `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 4
---
  def show
    @appointment = Appointment.find(params[:id])
    @note = Appointment.last.notes
    curr_id = current_user.id
    @my_notes = Note.where('user_id = ?', curr_id)

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 12 LIMIT 1
SELECT  `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 10  ORDER BY `notes`.`id` DESC LIMIT 1
---
  def edit
    @appointment = Appointment.find(params[:id])
    @note = @appointment.notes.last

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 12 LIMIT 1
SELECT  `notes`.* FROM `notes` WHERE `notes`.`appointment_id` = 24  ORDER BY `notes`.`id` DESC LIMIT 1
UPDATE `notes` SET `description` = 'headache', `updated_at` = '2018-01-16 15:23:11' WHERE `notes`.`id` = 14
---
  def update
    @appointment = Appointment.find(params[:id])

    if @appointment.update(appointment_params) && @appointment.notes.last.update(notes_params)

SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 10 LIMIT 1
DELETE FROM `appointments` WHERE `appointments`.`id` = 10
---
  def destroy

    @appointment = Appointment.find(params[:id])
    if @appointment.destroy