app/controllers/users_controller.rb

  def index
    #@users = User.all
    @patient_users = User.joins(:doctor_appointments)
---
SELECT `appointments`.* FROM `appointments` INNER JOIN `users` ON `users`.`id` = `appointments`.`doctor_id`
SELECT `users`.* FROM `users` INNER JOIN `appointments` ON `appointments`.`patient_id` = `users`.`id` WHERE (users.role = 1)

  def edit
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9  ORDER BY `users`.`id` ASC LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
UPDATE `users` SET `cover` = '1378141_210616312450311_2044160187_n.jpg', `updated_at` = '2018-01-15 10:16:53' WHERE `users`.`id` = 9