app/views/appointments/edit.html.erb

SELECT `users`.* FROM `users` WHERE (role = 1)
---
      <!-- <select>
        <% User.all.where('role = ?', 1).each do |doctor| %>